beeswithmachineguns/tests/ab-output-1.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking www.example.com (be patient)


Server Software:        nginx/1.0.15
Server Hostname:        www.example.com
Server Port:            9060

Document Path:          /some/path/?a=1&b=2&c=3
Document Length:        173 bytes

Concurrency Level:      100
Time taken for tests:   24.544 seconds
Complete requests:      62500
Failed requests:        24688
   (Connect: 0, Receive: 0, Length: 24688, Exceptions: 0)
Write errors:           0
Non-2xx responses:      37813
Keep-Alive requests:    62500
Total transferred:      16551810 bytes
HTML transferred:       6813217 bytes
Requests per second:    2546.40 [#/sec] (mean)
Time per request:       39.271 [ms] (mean)
Time per request:       0.393 [ms] (mean, across all concurrent requests)
Transfer rate:          658.56 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       8
Processing:     0   39  39.4     26     324
Waiting:        0   39  39.4     26     324
Total:          0   39  39.4     26     324

Percentage of the requests served within a certain time (ms)
  50%     26
  66%     43
  75%     57
  80%     66
  90%     93
  95%    121
  98%    153
  99%    175
 100%    324 (longest request)