beeswithmachineguns/tests/ab-output-2.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking www.example.com (be patient)


Server Software:        nginx/1.0.15
Server Hostname:        www.example.com
Server Port:            9060

Document Path:          /some/path/?a=1&b=2&c=3
Document Length:        11 bytes

Concurrency Level:      93
Time taken for tests:   9.663 seconds
Complete requests:      12500
Failed requests:        0
Write errors:           0
Keep-Alive requests:    12500
Total transferred:      2062500 bytes
HTML transferred:       137500 bytes
Requests per second:    1293.53 [#/sec] (mean)
Time per request:       71.896 [ms] (mean)
Time per request:       0.773 [ms] (mean, across all concurrent requests)
Transfer rate:          208.43 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.7      0      12
Processing:     5   72  17.6     69     228
Waiting:        5   72  17.6     69     228
Total:          6   72  17.5     69     228

Percentage of the requests served within a certain time (ms)
  50%     69
  66%     74
  75%     75
  80%     76
  90%     83
  95%    107
  98%    124
  99%    139
 100%    228 (longest request)